[
  {
    "title": "The Avocado's Surprising Origin Story",
    "fact": "The word 'avocado' comes from the Aztec Nahuatl word 'āhuacatl,' which, interestingly, also means 'testicle'."
  },
  {
    "title": "A Language That Can't See Blue",
    "fact": "The Himba people of Namibia do not distinguish between the colors blue and green. Their language's color categories are based on different shades and combinations, showing how language can shape perception."
  },
  {
    "title": "The Most Common Sound You've Never Heard Of",
    "fact": "The most common sound in all human languages is the 'schwa' (/ə/). It's that unstressed 'uh' sound you hear in words like 'sofa' or 'banana'."
  },
  {
    "title": "The Language Without Numbers",
    "fact": "The Pirahã language, spoken by a small tribe in the Amazon, has no words for specific numbers. They only have concepts for 'few' and 'many'."
  },
  {
    "title": "Why Do We Say 'OK'?",
    "fact": "The term 'OK' has a disputed origin, but a popular theory is that it started as an abbreviation for 'oll korrect,' a humorous misspelling of 'all correct' in the 1830s."
  },
  {
    "title": "The Word With a Thousand Meanings",
    "fact": "The Inuit language doesn't have hundreds of words for 'snow' as is commonly believed. However, it is a polysynthetic language, meaning it can create very long words that describe something in great detail, effectively combining what would be a sentence in English into one word."
  },
  {
    "title": "The Lonely Language",
    "fact": "Basque is a language isolate, meaning it is not related to any other known language in the world. It's a linguistic mystery surrounded by Indo-European languages."
  },
  {
    "title": "The Shortest Complete Sentence",
    "fact": "The shortest complete sentence in English is 'I am.' While 'Go.' is often cited, it's an imperative (a command) and is argued to have an implied 'you' as the subject."
  },
  {
    "title": "The Origin of the Dollar Sign ($)",
    "fact": "The dollar sign ($) is believed to have originated from the Spanish peso, which was abbreviated as 'PS'. Over time, the 'P' was written over the 'S', creating the modern symbol."
  },
  {
    "title": "A Language Whistled, Not Spoken",
    "fact": "In La Gomera, one of the Canary Islands, locals use Silbo Gomero, a whistled language to communicate over long distances across the deep valleys. It can be understood up to 5 miles away."
  },
  {
    "title": "The Word 'Clue' Used to Mean 'Ball of Yarn'",
    "fact": "In Greek mythology, Theseus used a ball of yarn, or a 'clew,' to find his way out of the Minotaur's labyrinth. The word 'clew' later evolved into 'clue,' meaning a piece of evidence that helps you solve a puzzle."
  },
  {
    "title": "The Only English Word Ending in 'mt'",
    "fact": "The word 'dreamt' is the only common English word that ends in the letters 'mt'."
  },
  {
    "title": "The Alphabetical Order Invention",
    "fact": "The concept of alphabetical order is not natural. It was invented by scholars or scribes in the ancient Near East, likely for organizing lists of words or names on clay tablets."
  },
  {
    "title": "The Word 'Mortgage' Literally Means 'Death Pledge'",
    "fact": "The word 'mortgage' comes from Old French, where 'mort' means 'dead' and 'gage' means 'pledge'. It refers to the pledge ending (dying) when the loan is paid off or when the borrower fails to pay."
  },
  {
    "title": "A Language with Clicks",
    "fact": "Languages in Southern Africa, like !Xóõ and Zulu, incorporate click consonants as part of their regular speech sounds. The !Xóõ language has over 100 different click sounds."
  },
  {
    "title": "The Longest Word in English",
    "fact": "The longest word found in a major dictionary is 'pneumonoultramicroscopicsilicovolcanoconiosis,' a lung disease caused by inhaling fine silicate or quartz dust."
  },
  {
    "title": "Why Q is Always Followed by U",
    "fact": "In English, the letter 'Q' is almost always followed by 'U' because English borrowed this spelling convention from Latin. The 'U' represents the 'w' sound that originally followed the 'q'."
  },
  {
    "title": "The Brain's Language Centers",
    "fact": "For most right-handed people, language processing is controlled by the left hemisphere of the brain, specifically in two areas: Broca's area (for speech production) and Wernicke's area (for comprehension)."
  },
  {
    "title": "The Origin of the Ampersand (&)",
    "fact": "The ampersand symbol (&) is a ligature of the letters 'e' and 't' from the Latin word 'et,' which means 'and'. It was often recited as the 27th letter of the alphabet at the end of the alphabet song: '...X, Y, Z, and per se and.'"
  },
  {
    "title": "The First Written Word",
    "fact": "The earliest known written word is a Sumerian cuneiform symbol for 'beer', found on a clay tablet from ancient Mesopotamia dating back to around 6,000 years ago."
  },
  {
    "title": "A Language with No Vowels",
    "fact": "Some languages in the Caucasus region, like Ubykh (which is now extinct), had very few vowels. Ubykh was famous for having around 84 consonants and only 2 vowels."
  },
  {
    "title": "The Word 'Sincere' Has a Humble Origin",
    "fact": "One popular theory suggests the word 'sincere' comes from the Latin 'sine cera', meaning 'without wax'. Roman sculptors supposedly used wax to hide mistakes in their marble work; a sculpture 'without wax' was a genuine, honest piece."
  },
  {
    "title": "The Pangram Challenge",
    "fact": "A 'pangram' is a sentence that uses every letter of the alphabet at least once. 'The quick brown fox jumps over the lazy dog' is the most famous English pangram."
  },
  {
    "title": "The Invention of the Space Bar",
    "fact": "The ancient Greeks and Romans wrote without spaces between words. The use of spaces to separate words was first introduced by Irish and Scottish monks in the 7th and 8th centuries to make Latin and Gaelic texts easier to read."
  },
  {
    "title": "The Most Translated Document",
    "fact": "The most translated document in the world is the Bible. However, the Universal Declaration of Human Rights holds the Guinness World Record for the most translated document, available in over 500 languages."
  },
  {
    "title": "A Language That Changes Your Brain",
    "fact": "Learning a new language can physically change your brain's structure, increasing the size of the hippocampus and the cerebral cortex, areas related to memory and learning."
  },
  {
    "title": "The 'Ironic' Comma",
    "fact": "The Oxford comma (or serial comma) is the comma used before the conjunction 'and' in a list of three or more things. Its use is a highly debated topic among grammar enthusiasts."
  },
  {
    "title": "The Word 'Goodbye' Was a Blessing",
    "fact": "The word 'goodbye' is a contraction of the phrase 'God be with ye'. It was a common farewell blessing in the 16th century that evolved over time."
  },
  {
    "title": "Why Are Letters in a Certain Order?",
    "fact": "No one is exactly sure why our alphabet is in the specific A-B-C order. It's an order that has been passed down for thousands of years from its Phoenician origins, and its original logic, if any, has been lost."
  },
  {
    "title": "The First 'Emoji'",
    "fact": "The first emoji was created in 1999 by Shigetaka Kurita, a Japanese designer. He was part of a team working on a mobile internet platform and wanted a simple way to convey information visually, like weather forecasts."
  },
  {
    "title": "A Language with Only 12 Letters",
    "fact": "The Rotokas language, spoken by about 4,000 people on the island of Bougainville in Papua New Guinea, has one of the smallest alphabets in the world, with only 12 letters."
  },
  {
    "title": "The Word 'Quiz' Was a Bet",
    "fact": "A popular, though unproven, story claims the word 'quiz' was invented in the 1790s by a Dublin theater owner named Richard Daly. He made a bet that he could introduce a new word into the language within 48 hours and had his staff chalk the word 'QUIZ' on walls all over the city."
  },
  {
    "title": "The Longest Palindrome",
    "fact": "A palindrome is a word or phrase that reads the same backward and forward. The longest single-word palindrome in English is 'tattarrattat', coined by James Joyce in Ulysses to describe a knock on the door."
  },
  {
    "title": "The Most Difficult Word to Translate",
    "fact": "The word 'ilunga' from the Tshiluba language (spoken in Congo) was once voted the most difficult word to translate. It means 'a person who is ready to forgive any abuse the first time, to tolerate it a second time, but never a third time'."
  },
  {
    "title": "The Language of Computers",
    "fact": "All digital data, including the text you're reading, is ultimately represented by binary code: a sequence of 1s and 0s. Each letter or character is assigned a unique binary number."
  },
  {
    "title": "The Origin of the Question Mark (?)",
    "fact": "The question mark is thought to have originated from the Latin word 'quaestio', meaning 'question'. Scribes would write 'qo' at the end of a question, which over time was stylized into the modern '?' symbol."
  },
  {
    "title": "A Word for the Smell of Rain",
    "fact": "The word 'petrichor' describes the pleasant, earthy smell produced when rain falls on dry soil. It's derived from the Greek 'petra' (stone) and 'ichor' (the fluid that flows in the veins of the gods)."
  },
  {
    "title": "The Most Spoken Language",
    "fact": "English is the most spoken language in the world if you count both native and non-native speakers. However, Mandarin Chinese has the most number of native speakers."
  },
  {
    "title": "The Word 'Girl' Used to Mean a Child",
    "fact": "In Middle English, the word 'girl' or 'girle' referred to a child or young person of any gender. It wasn't until the 16th century that it came to specifically mean a female child."
  },
  {
    "title": "The First Dictionary",
    "fact": "The first single-language English dictionary was 'Table Alphabeticall', written by Robert Cawdrey and published in 1604. It only contained about 3,000 words and was meant to help people understand 'hard usual English words'."
  },
  {
    "title": "Why Do We Call It a 'Freelancer'?",
    "fact": "The term 'freelance' comes from Sir Walter Scott's novel 'Ivanhoe' (1819). It described a medieval mercenary warrior—a 'free lance'—whose lance (a weapon) was available for hire to any lord."
  },
  {
    "title": "The Language with No 'Yes' or 'No'",
    "fact": "The Irish language has no direct words for 'yes' or 'no'. Instead, speakers answer a question by repeating the verb, either positively or negatively. For example, to 'Did you see him?' you would answer 'I saw' or 'I did not see'."
  },
  {
    "title": "The Origin of the Word 'Nightmare'",
    "fact": "The word 'nightmare' has nothing to do with horses. In Old English, the 'mare' was a mythological demon or goblin known to sit on people's chests while they slept, causing a feeling of suffocation and bad dreams."
  },
  {
    "title": "The Power of a Name",
    "fact": "In many cultures, a person's 'true name' is considered sacred and powerful. It's believed that knowing someone's true name gives you power over them, which is why secret or nicknames are often used in public."
  },
  {
    "title": "The Word 'Assassin' Comes from 'Hashish'",
    "fact": "The word 'assassin' is derived from the Arabic word 'hashishin'. It referred to a secretive order of warriors (the Nizari Isma'ili) in the Middle Ages who were rumored to consume hashish before carrying out their missions."
  },
  {
    "title": "A Sentence That Contains All Parts of Speech",
    "fact": "The sentence 'I did it because I can.' contains a pronoun (I), a verb (did), a pronoun (it), a conjunction (because), a pronoun (I), a modal verb (can), and a punctuation mark (.)."
  },
  {
    "title": "The Language of the Future",
    "fact": "Linguists predict that by the end of this century, about half of the world's 7,000 languages could be extinct, as globalization encourages people to learn more dominant languages for economic and social reasons."
  },
  {
    "title": "The Word 'Robot' Has a Dark Origin",
    "fact": "The word 'robot' was first introduced in a 1920 play by Czech writer Karel Čapek, titled 'R.U.R.' (Rossum's Universal Robots). It comes from the Czech word 'robota', which means 'forced labor' or 'drudgery'."
  },
  {
    "title": "The Only Word with Two Double U's",
    "fact": "The word 'unusual' is often cited, but the only word in the English language that contains two consecutive 'u's is 'vacuum'."
  }
]
